In [2]:
import pandas as pd

df=pd.read_csv("employee_sal.csv")

In [3]:
df.head()

   Employee_ID           Name   Department  Salary
0          101       John Doe  Engineering   75000
1          102     Jane Smith    Marketing   65000
2          103  Emily Johnson           HR   48000
3          104  Michael Brown  Engineering   80000
4          105   Chris Wilson        Sales   55000

In [4]:
df.describe()

       Employee_ID        Salary
count    15.000000     15.000000
mean    108.000000  62133.333333
std       4.472136  13474.137485
min     101.000000  45000.000000
25%     104.500000  50000.000000
50%     108.000000  62000.000000
75%     111.500000  73500.000000
max     115.000000  85000.000000

In [5]:
filtered_df = df[df['Salary'] > 50000]
print(filtered_df)

    Employee_ID           Name   Department  Salary
0           101       John Doe  Engineering   75000
1           102     Jane Smith    Marketing   65000
3           104  Michael Brown  Engineering   80000
4           105   Chris Wilson        Sales   55000
5           106  Anna Martinez    Marketing   62000
7           108   Sophia White  Engineering   78000
8           109   James Harris        Sales   53000
9           110  Olivia Taylor    Marketing   67000
11          112     Emma Scott  Engineering   51000
13          114  Natalie Evans    Marketing   72000
14          115  William Adams  Engineering   85000

In [6]:
filtered_df.to_csv("filtered_salaries.csv", index=False)